/***************************************************************
 *
 * Copyright (C) 1990-2007, Condor Team, Computer Sciences Department,
 * University of Wisconsin-Madison, WI.
 * 
 * Licensed under the Apache License, Version 2.0 (the "License"); you
 * may not use this file except in compliance with the License.  You may
 * obtain a copy of the License at
 * 
 *    http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ***************************************************************/


#include "condor_common.h"
#include "condor_config.h"
#include "condor_attributes.h"
#include "condor_state.h"
#include "sig_install.h"
#include "daemon.h"
#include "dc_collector.h"
#include "match_prefix.h"    // is_arg_colon_prefix
#include "ad_printmask.h"
#include "condor_string.h"
#include "directory.h"
#include "format_time.h"
#include "console-utils.h"
#include "ipv6_hostname.h"
#include <my_popen.h>

#include "condor_distribution.h"
#include "condor_version.h"
#include "condor_environ.h"
#include "setenv.h"
#include "condor_claimid_parser.h"
#include "tokener.h"

#include <vector>
#include <map>

#include "backward_file_reader.h"
#ifdef WIN32
  #include "ntsysinfo.WINDOWS.h" // for CSysInfo to get redacted environment vars
#endif

using std::vector;
using std::map;
using std::string;

// stuff that we can scrape from the log directory about various daemons.
//
typedef struct {
	std::string name;  // Daemon name, (note Starters are named SlotN)
	std::string addr;  // sinful string from .address file, if available
	std::string log_dir;// log directory
	std::string log;     // log filename
	std::string log_old; // previous (.old) log file full path name.
	std::string exe_path; // full path to executable (from master log)
	std::string pid;      // latest process id (from master log, starterlog, etc)
	std::string exit_code; // if daemon has exited, this is the exit code otherwise empty
} LOG_INFO;

typedef std::map<std::string, LOG_INFO*> LOG_INFO_MAP;
typedef std::map<std::string, pid_t> MAP_STRING_TO_PID;
typedef std::map<pid_t, std::string> MAP_STRING_FROM_PID;
typedef std::map<std::string, std::vector<std::string> > TABULAR_MAP;
typedef std::map<std::string, std::string> MAP_STRING_TO_STRING;

//char	*param();
static void query_log_dir(const char * log_dir, LOG_INFO_MAP & info, bool chatty);
static void print_log_info(LOG_INFO_MAP & info);
static void print_daemon_info(LOG_INFO_MAP & info, bool fQuick);
static void scan_logs_for_info(LOG_INFO_MAP & info, MAP_STRING_TO_PID & job_to_pid, bool fAddressesOnly);
static void scan_a_log_for_info(LOG_INFO_MAP & info, MAP_STRING_TO_PID & job_to_pid, LOG_INFO_MAP::const_iterator & it);

static void query_daemons_for_pids(LOG_INFO_MAP & info);
static void ping_all_known_addrs(LOG_INFO_MAP & info);
static char * get_daemon_param(const char * addr, const char * param_name);
static bool get_daemon_ready(const char * addr, const char * requirements, time_t sec_to_wait, ClassAd & ready_ad, const char * session=nullptr);
static void quick_get_addr_from_master(const char * master_addr, pid_t pid, std::string & addr);
static const char * lookup_security_session_for_addr(const char * addr);

// we need AdTypes enum values for ads that the startd can return that are not in the AdTypes enum
//
enum ExtendedAdTypes : long {
	UNSET_AD = -1,
	MULTI_ADS = AdTypes::BOGUS_AD,
	dSLOT_ADS = AdTypes::SLOT_AD,
	DAEMON_AD = AdTypes::STARTDAEMON_AD,
	FIRST_EXTENDED_ADTYPE = AdTypes::NUM_AD_TYPES,
	JOB_AD,
	CLAIM_AD,
	SLOT_CONFIG_AD,
	SLOT_STATE_AD,
	MACHINE_EXTRA_AD,
};

const char* AdTypeToString(ExtendedAdTypes type) {
	if (type < FIRST_EXTENDED_ADTYPE) {
		return AdTypeToString((AdTypes)type);
	}
	switch (type) {
	case JOB_AD: return JOB_ADTYPE;
	case CLAIM_AD: return "Slot.Claim";
	case SLOT_CONFIG_AD: return "Slot.Config";
	case SLOT_STATE_AD: return "Slot.State";
	case MACHINE_EXTRA_AD: return "Machine.Extra";
	default: break;
	}
	return "unknown";
}

ExtendedAdTypes StringToExAdType(std::string_view str) {
	if (str == STARTD_SLOT_ADTYPE) return dSLOT_ADS; // AdTypeToString would map this to STARTD_AD, but we want dSLOT_ADS
	if (str == JOB_ADTYPE) return JOB_AD;
	if (str == "Slot.Claim") return CLAIM_AD;
	if (str == "Slot.Config") return SLOT_CONFIG_AD;
	if (str == "Slot.State") return SLOT_STATE_AD;
	if (str == "Machine.Extra") return MACHINE_EXTRA_AD;
	for (int i = 0; i < NUM_AD_TYPES; i++) {
		AdTypes type = static_cast<AdTypes>(i);
		if (str == AdTypeToString(type)) {
			return (ExtendedAdTypes)type;
		}
	}
	return UNSET_AD;
}

// app globals
static struct AppType {
	const char * Name; // tool name as invoked from argv[0]
	std::vector<const char *> target_names;    // list of target names to query
	std::vector<LOG_INFO *>   all_log_info;    // pool of info from scanning log directories.

	classad::References projection;    // Attributes that we want the server to send us
	printmask_headerfooter_t print_mask_headfoot = STD_HEADFOOT;
	std::vector<GroupByKeyInfo> group_by_keys;

	AttrListPrintMask print_mask;      // formatting of the main table
	ExtendedAdTypes printAdType;       // AdType of the main table
	AttrListPrintMask summary_mask;    // formatting of the summary after the table

	AttrListPrintMask banner_mask;     // formatting of the banner above the main table

	union {
		unsigned int mask{0}; // output useful only to developers
		struct {
			unsigned int basic   :1; // 0x000001
			unsigned int verbose :1; // 0x000002
			unsigned int addr    :1; // 0x000004
			unsigned int logs    :1; // 0x000008
			unsigned int query   :2; // 0x000030
			unsigned int format  :2; // 0x0000c0
			unsigned int tables  :2; // 0x000300
			unsigned int ads     :2; // 0x000c00
			unsigned int ps      :2; // 0x003000
			unsigned int nets    :2; // 0x00c000
			unsigned int env     :2; // 0x030000
		};
	} diag;

	bool   verbose;    // extra output useful to users
	bool   wide;       // don't truncate to fit the screen
	bool   show_daemons;    // print a a table of daemons pids and addresses
	bool   daemon_mode;     // condor_who in 'daemon_mode' showing info about daemons rather than info about jobs.
	bool   dash_ospool{false};     // customizations for OSPool glideins
	bool   show_full_ads;
	bool   show_active_slots; // default output, show active slots
	bool   show_job_ad;      // show jobs table rather than slots table
	bool   startd_daemon_ad; // show startd daemon ad rather than slots
	bool   scan_pids;       // query all schedds found via ps/tasklist
	bool   have_config_log_dir; // condor_who read a config, and found a log dir in it
	bool   quick_scan;      // do only the scanning that can be done quickly (i.e. no talking to daemons)
	bool   timed_scan;
	bool   ping_all_addrs;	 //
